---
type: PhaseFilter
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# PhaseFilter

`Autodesk.Revit.DB.PhaseFilter` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2013 | `public static PhaseFilter Create ( Document document , string name )` |
| Method | GetPhaseStatusPresentation | 2013 | `public PhaseStatusPresentation GetPhaseStatusPresentation ( ElementOnPhaseStatus status )` |
| Method | SetPhaseStatusPresentation | 2013 | `public void SetPhaseStatusPresentation ( ElementOnPhaseStatus status , PhaseStatusPresentation presentation )` |
| Property | IsDefault | 2013 | `public bool IsDefault { get ; }` |
| Property | Parameter | — | `` |